PAT

Router(config)# access-list 1 permit 192.168.0.0 0.0.255.255
Router(config)# ip nat inside source list 1 interface serial0/1/0 overload
Router(config)# interface serial0/0/0 # Inside int.
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)# interface serial0/1/0 # Outside int.
Router(config-if)#ip nat outside

show ip nat statistics
show ip nat translations
debug ip nat

Static NAT

ip nat inside source static tcp 192.168.3.2 80 210.210.1.2 80 

Dynamic NAT

int f0/0
ip nat inside
int f0/1
ip nat outside
access-list NAT-SOURCES permit 10.0.0.0 0.0.0.255
ip nat pool PUBLICIPS 155.4.12.1 155.4.12.3 netmask 255.255.255.0
ip nat inside source list NAT-SOURCES pool PUBLISIPS interface serial0/1/0 #can also use overload, basically people call it Dynamic PAT

#NOTE if you forget to put overload - only the 1st PC to access the outside network will have a connection because it caches NAT translations


###Update about NVI###
https://www.ciscozine.com/nat-virtual-interface-aka-nvi-what-is-that/
https://networklessons.com/cisco/ccie-routing-switching/nat-virtual-interface
https://blog.sliderweb.ru/blog/post/nvi-nat-cisco
https://www.youtube.com/watch?v=eTPJl0O-m8o&ab_channel=%E9%B4%BB%E6%84%9C%E6%84%8F
###For instance, if you use legacy statement###

Ciscozine(config)#interface range fastEthernet 0/0
Ciscozine(config-if-range)#ip nat inside

Ciscozine(config)#interface range fastEthernet 0/1
Ciscozine(config-if-range)#ip nat outside

Ciscozine(config)#ip nat inside source static 172.16.0.6 10.16.0.5

with NVI feature the nat will be:

Ciscozine(config)#interface range fastEthernet 0/0
Ciscozine(config-if-range)#ip nat enable

Ciscozine(config)#interface range fastEthernet 0/1
Ciscozine(config-if-range)#ip nat enable

Ciscozine(config)#ip nat source static 172.16.0.6 10.16.0.5


################# VRF Related Cisco Document ########################
https://community.cisco.com/legacyfs/online/legacy/0/8/0/60080-NAT%20Virtual%20Interface.pdf
https://www.youtube.com/watch?v=r2Zs3lr9Ps0&t=372s&ab_channel=TravisBonfigli


#### NAT Hairpin ### 
https://community.cisco.com/t5/routing/nat-hairpinning/td-p/2475807

With this scenario, I would to reach my webserver from my internal LAN, on public IP of the web server (in this case 10.10.10.154). 
As we know, with a "normal" configuration my HTTP request fail, because my request to 10.10.10.154 from 192.168.100.10 goes toward the router,
who knows that 10.10.10.154 is statically natted to 192.168.100.254, then he route our packet directly to 192.168.100.254 without go out from our LAN. 
The web server see the HTTP request from 192.168.100.10 then reply directly to that IP. The 3-way Handshake fail because our PC expects a reply from 10.10.10.154 and not from 192.168.100.254.

 NVI
У всех предыдущих примеров настройки NATа есть один большой косяк. 
Допустим, к роутеру подключен ещё и сервер, который находится в DMZ. 
Для него настроен статический NAT. Проблема в том, что клиент из локальной сети до такого сервера не будет иметь доступ. 
Причина в том, как работает NAT в его классическом варианте. 
Трафик от клиента попадет на роутер в inside интерфейс, смаршрутизируется на outside интерфtйс, там произойдет трансляция, после чего трафик уйдет на сервер. 
Проблема в обратном трафике. Трафик от сервера попадет на интерфейс в который подключен сервер. 
Тут должна произойти обратная последовательность NAT и затем routing. Но обратный трафик не попадет на outside интерфейс, весь сервер подключен к inside. 
А значит обратная трансляция не произойдет. Таким образом, трафик не будет натится и обратный трафик не дойдет до пользователя.
